In [2]:
import pandas as pd
import numpy as np

np.random.seed(101)

In [3]:
df = pd.DataFrame(np.random.randn(5,4), index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [3]:
df = pd.DataFrame({'col1':[1,5,3,2,4],'col2':[444,222,666,444,555],'col3':['abc','xyz','ijklmn','xyz', 'defgh']})
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [4]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [5]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df.values

array([[1, 444, 'abc'],
       [5, 222, 'xyz'],
       [3, 666, 'ijklmn'],
       [2, 444, 'xyz'],
       [4, 555, 'defgh']], dtype=object)

In [8]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [9]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [11]:
df['col1'].unique()

array([1, 5, 3, 2, 4], dtype=int64)

In [12]:
df['col1'].nunique()

5

In [14]:
df['col2'].unique()

array([444, 222, 666, 555], dtype=int64)

In [15]:
df['col2'].nunique()

4

In [21]:
df['col2'].value_counts()

444    2
222    1
666    1
555    1
Name: col2, dtype: int64

In [20]:
df['col2'].value_counts().index

Int64Index([444, 222, 666, 555], dtype='int64')

[2, 1, 1, 1]

[444, 222, 666, 555]

In [25]:
zip (list (df['col2'].value_counts().index),list (df['col2'].value_counts()))

[(444, 2), (222, 1), (666, 1), (555, 1)]

In [26]:
{key:value for key, value in zip (list (df['col2'].value_counts().index),list (df['col2'].value_counts())) }

{444: 2, 222: 1, 666: 1, 555: 1}

In [29]:
dict (zip (list (df['col2'].value_counts().index),list (df['col2'].value_counts())))

{444: 2, 222: 1, 666: 1, 555: 1}

In [27]:
df['col2'].value_counts().to_dict()

{444: 2, 222: 1, 666: 1, 555: 1}

In [31]:
## Sort Values

In [32]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [34]:
df.sort_values(by ='col1' , ascending=False)

   col1  col2    col3
1     5   222     xyz
4     4   555   defgh
2     3   666  ijklmn
3     2   444     xyz
0     1   444     abc

In [37]:
df.sort_values(by ='col2' , inplace=True)

In [38]:
df

   col1  col2    col3
1     5   222     xyz
0     1   444     abc
3     2   444     xyz
4     4   555   defgh
2     3   666  ijklmn

In [39]:
df.sort_values(by= ['col2' , 'col1'] , ascending=[True, False])

   col1  col2    col3
1     5   222     xyz
3     2   444     xyz
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn

In [40]:
df

   col1  col2    col3
1     5   222     xyz
0     1   444     abc
3     2   444     xyz
4     4   555   defgh
2     3   666  ijklmn

In [41]:
df.sort_values(by= ['col2' , 'col1'] , ascending=[True, False] , inplace=True)

In [43]:
df.sort_values(by =['col3', 'col1' , 'col2'] ,ascending=[True, False, False])

   col1  col2    col3
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn
1     5   222     xyz
3     2   444     xyz

In [44]:
df

   col1  col2    col3
1     5   222     xyz
3     2   444     xyz
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn

In [45]:
df.mean()

C:\Users\WAEL~1.MOH\AppData\Local\Temp/ipykernel_25940/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

col1      3.0
col2    466.2
dtype: float64

In [49]:
df[['col1' , 'col2']].mean(axis=1)

1    113.5
3    223.0
0    222.5
4    279.5
2    334.5
dtype: float64

In [50]:
df

   col1  col2    col3
1     5   222     xyz
3     2   444     xyz
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn

In [51]:
df.median()

C:\Users\WAEL~1.MOH\AppData\Local\Temp/ipykernel_25940/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

col1      3.0
col2    444.0
dtype: float64

In [53]:
df[['col1' , 'col2' ]].median()

col1      3.0
col2    444.0
dtype: float64

In [59]:
df.mode()

   col1   col2 col3
0     1  444.0  xyz
1     2    NaN  NaN
2     3    NaN  NaN
3     4    NaN  NaN
4     5    NaN  NaN

In [60]:
df[['col1' , 'col2']].std()

col1      1.581139
col2    164.639606
dtype: float64

In [63]:
df

   col1  col2    col3
1     5   222     xyz
3     2   444     xyz
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn

In [64]:
Q1 = df.quantile(0.25)

col1      2.0
col2    444.0
Name: 0.25, dtype: float64

In [67]:
df.sort_values('col1')

   col1  col2    col3
0     1   444     abc
3     2   444     xyz
2     3   666  ijklmn
4     4   555   defgh
1     5   222     xyz

In [68]:
Q1

col1      2.0
col2    444.0
Name: 0.25, dtype: float64

In [69]:
Q3 = df.quantile(0.75)

In [70]:
Q3

col1      4.0
col2    555.0
Name: 0.75, dtype: float64

In [71]:
iqr = Q3 - Q1

In [72]:
iqr

col1      2.0
col2    111.0
dtype: float64

In [73]:
df.corr()

          col1      col2
col1  1.000000 -0.319801
col2 -0.319801  1.000000

In [74]:
df

   col1  col2    col3
1     5   222     xyz
3     2   444     xyz
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn

In [75]:
df.max()

col1      5
col2    666
col3    xyz
dtype: object

In [76]:
df

   col1  col2    col3
1     5   222     xyz
3     2   444     xyz
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn

In [77]:
df.min()

col1      1
col2    222
col3    abc
dtype: object

In [81]:
df[['col1' , 'col2']].max(axis=0)

col1      5
col2    666
dtype: int64

In [83]:
df[['col1' , 'col2']].max(axis=1)

1    222
3    444
0    444
4    555
2    666
dtype: int64

In [85]:
df[['col1' , 'col2']].min(axis=1)

1    5
3    2
0    1
4    4
2    3
dtype: int64

In [86]:
df.sum()

col1                      15
col2                    2331
col3    xyzxyzabcdefghijklmn
dtype: object

In [87]:
df.sum(axis=1)

C:\Users\WAEL~1.MOH\AppData\Local\Temp/ipykernel_25940/1459321664.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

1    227
3    446
0    445
4    559
2    669
dtype: int64

In [89]:
df

   col1  col2    col3
1     5   222     xyz
3     2   444     xyz
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    5 non-null      int64
 2   col3    5 non-null      object
dtypes: int64(2), object(1)
memory usage: 160.0+ bytes

In [88]:
df.sum(axis=0)

col1                      15
col2                    2331
col3    xyzxyzabcdefghijklmn
dtype: object

In [91]:
df.count()

col1    5
col2    5
col3    5
dtype: int64

In [92]:
df.count(axis=1)

1    3
3    3
0    3
4    3
2    3
dtype: int64

In [93]:
df = pd.DataFrame({'col1':[1,2,3,np.nan, 4, 5, 6],
                   'col2':[np.nan,555,666,444, 4, 5, 6],
                   'col3':['abc','def','ghi','xyz', 4, 5, 6],
                   'col4':['abc','def','ghi','xyz', 4, 5, 6],
                   'col5':['abc','def','ghi','xyz', 4, 5, 6]})

In [94]:
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [95]:
df.head()

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4

In [96]:
df.tail()

   col1   col2 col3 col4 col5
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [97]:
df.head(10)

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [101]:
df.sort_values(by='col1' , ascending=False).head(3)

   col1  col2 col3 col4 col5
6   6.0   6.0    6    6    6
5   5.0   5.0    5    5    5
4   4.0   4.0    4    4    4

In [102]:
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    6 non-null      float64
 1   col2    6 non-null      float64
 2   col3    7 non-null      object
 3   col4    7 non-null      object
 4   col5    7 non-null      object
dtypes: float64(2), object(3)
memory usage: 408.0+ bytes

In [105]:
df.describe()

           col1        col2
count  6.000000    6.000000
mean   3.500000  280.000000
std    1.870829  309.319899
min    1.000000    4.000000
25%    2.250000    5.250000
50%    3.500000  225.000000
75%    4.750000  527.250000
max    6.000000  666.000000

In [106]:
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [108]:
df = pd.DataFrame({'col1':[1,5,3,2,4],'col2':[444,222,666,444,555],'col3':['abc','xyz','ijklmn','xyz', 'defgh']})
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [109]:
df['radius'] = df['col1'] + 20

In [111]:
def area_of_circle (r) : 
    return 3.14 * (r**2)

In [113]:
df['area'] = df['radius'].apply(area_of_circle)

In [114]:
df

   col1  col2    col3  radius     area
0     1   444     abc      21  1384.74
1     5   222     xyz      25  1962.50
2     3   666  ijklmn      23  1661.06
3     2   444     xyz      22  1519.76
4     4   555   defgh      24  1808.64

In [115]:
df['area_lambda'] = df['radius'].apply(lambda r: 3.14 * (r**2))

In [116]:
df

   col1  col2    col3  radius     area  area_lambda
0     1   444     abc      21  1384.74      1384.74
1     5   222     xyz      25  1962.50      1962.50
2     3   666  ijklmn      23  1661.06      1661.06
3     2   444     xyz      22  1519.76      1519.76
4     4   555   defgh      24  1808.64      1808.64

In [117]:
df['col1'].apply(lambda x:x**2)

0     1
1    25
2     9
3     4
4    16
Name: col1, dtype: int64

In [118]:
df['col3_len'] = df['col3'].apply(len)

In [119]:
df

   col1  col2    col3  radius     area  area_lambda  col3_len
0     1   444     abc      21  1384.74      1384.74         3
1     5   222     xyz      25  1962.50      1962.50         3
2     3   666  ijklmn      23  1661.06      1661.06         6
3     2   444     xyz      22  1519.76      1519.76         3
4     4   555   defgh      24  1808.64      1808.64         5

In [120]:
## apply a function to return multi colmuns

In [125]:
def make_multi_col (value) : 
    return pd.Series ((value+100, value - 100))

In [126]:
df[['new_col1' , 'new_col2']] = df['radius'].apply(make_multi_col)

In [127]:
df

,col1,col2,col3,radius,area,area_lambda,col3_len,new_col1,new_col2
0,1,444,abc,21,1384.74,1384.74,3,121,-79
1,5,222,xyz,25,1962.50,1962.50,3,125,-75
2,3,666,ijklmn,23,1661.06,1661.06,6,123,-77
3,2,444,xyz,22,1519.76,1519.76,3,122,-78
4,4,555,defgh,24,1808.64,1808.64,5,124,-76

In [135]:
def apply_multi_columns_make_multi_columns(x):
    return pd.Series((x['area'] / x['radius'], x['radius'] + x['area']))

In [136]:
df[['new_col4' , 'new_col5']]=df.apply( apply_multi_columns_make_multi_columns, axis=1)

df

## Group_by

In [144]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Sam','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Calls': [60,190,2,100,700,423]}

In [145]:
df = pd.DataFrame(data)

In [146]:
df

  Company   Person  Sales  Calls
0    GOOG      Sam    200     60
1    GOOG  Charlie    120    190
2    MSFT      Amy    340      2
3    MSFT  Vanessa    124    100
4      FB      Sam    243    700
5      FB    Sarah    350    423

In [147]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
 3   Calls    6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [149]:
df.groupby('Company').min()

          Person  Sales  Calls
Company
FB           Sam    243    423
GOOG     Charlie    120     60
MSFT         Amy    124      2

In [150]:
df

  Company   Person  Sales  Calls
0    GOOG      Sam    200     60
1    GOOG  Charlie    120    190
2    MSFT      Amy    340      2
3    MSFT  Vanessa    124    100
4      FB      Sam    243    700
5      FB    Sarah    350    423

In [151]:
df.groupby('Company').std()

              Sales       Calls
Company
FB        75.660426  195.868578
GOOG      56.568542   91.923882
MSFT     152.735065   69.296465

In [152]:
df.groupby('Company').max()

          Person  Sales  Calls
Company
FB         Sarah    350    700
GOOG         Sam    200    190
MSFT     Vanessa    340    100

In [153]:
df.groupby('Company').count()

         Person  Sales  Calls
Company
FB            2      2      2
GOOG          2      2      2
MSFT          2      2      2

In [154]:
df

  Company   Person  Sales  Calls
0    GOOG      Sam    200     60
1    GOOG  Charlie    120    190
2    MSFT      Amy    340      2
3    MSFT  Vanessa    124    100
4      FB      Sam    243    700
5      FB    Sarah    350    423

In [155]:
df.groupby('Company').sum()

         Sales  Calls
Company
FB         593   1123
GOOG       320    250
MSFT       464    102

In [158]:
grouped_data = df.groupby('Company')

In [160]:
grouped_data.get_group('FB')['Sales'].min()

243

In [162]:
grouped_data.get_group('FB')['Calls'].max()

700

In [164]:
df.groupby('Company').describe()

        Sales                                                         Calls  \
        count   mean         std    min     25%    50%     75%    max count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0   2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0   2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0   2.0


          mean         std    min     25%    50%     75%    max
Company
FB       561.5  195.868578  423.0  492.25  561.5  630.75  700.0
GOOG     125.0   91.923882   60.0   92.50  125.0  157.50  190.0
MSFT      51.0   69.296465    2.0   26.50   51.0   75.50  100.0

In [165]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000
Calls count    2.000000    2.000000    2.000000
      mean   561.500000  125.000000   51.000000
      std    195.868578   91.923882   69.296465
      min    423.000000   60.000000    2.000000
      25%    492.250000   92.500000   26.500000
      50%    561.500000  125.000000   51.000000
      75%    630.750000  157.500000   75.500000
      max    700.000000  190.000000  100.000000

In [172]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Calls  count      2.000000
       mean     561.500000
       std      195.868578
       min      423.000000
       25%      492.250000
       50%      561.500000
       75%      630.750000
       max      700.000000
Name: FB, dtype: float64

In [171]:
grouped_data.get_group('FB').describe().transpose()

       count   mean         std    min     25%    50%     75%    max
Sales    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Calls    2.0  561.5  195.868578  423.0  492.25  561.5  630.75  700.0

## movies Project

### Read_data

In [174]:
movies_df = pd.read_csv('imdb_movies.csv')

In [175]:
movies_df.head()

,ranking of movie,movie name,Year,certificate,runtime,genre,RATING,DETAIL ABOUT MOVIE,DIRECTOR,ACTOR 1,ACTOR 2,ACTOR 3,ACTOR 4,votes,metascore,GROSS COLLECTION
0,1,Jai Bhim,-2021,TV-MA,164 min,"Crime, Drama",9.4,When a tribal man is arrested for a case of al...,T.J. Gnanavel,Suriya,Lijo Mol Jose,Manikandan,Rajisha Vijayan,163431,NaN,NaN
1,2,The Shawshank Redemption,-1994,R,142 min,Drama,9.3,Two imprisoned men bond over a number of years...,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2515762,80.0,$28.34M
2,3,The Godfather,-1972,R,175 min,"Crime, Drama",9.2,"The Godfather follows Vito Corleone, Don of th...",Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1732749,100.0,$134.97M
3,4,The Dark Knight,-2008,PG-13,152 min,"Action, Crime, Drama",9.0,When the menace known as the Joker wreaks havo...,Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,2466041,84.0,$534.86M
4,5,The Godfather: Part II,-1974,R,202 min,"Crime, Drama",9.0,The early life and career of Vito Corleone in ...,Francis Ford Coppola,Al Pacino,Robert De Niro,Robert Duvall,Diane Keaton,1202401,90.0,$57.30M

In [176]:
movies_df.tail()

,ranking of movie,movie name,Year,certificate,runtime,genre,RATING,DETAIL ABOUT MOVIE,DIRECTOR,ACTOR 1,ACTOR 2,ACTOR 3,ACTOR 4,votes,metascore,GROSS COLLECTION
245,246,Mr. Smith Goes to Washington,-1939,Passed,129 min,"Comedy, Drama",8.1,A naive youth leader is appointed to fill a va...,Frank Capra,James Stewart,Jean Arthur,Claude Rains,Edward Arnold,112642,73.0,$9.60M
246,247,Gone with the Wind,-1939,Passed,238 min,"Drama, History, Romance",8.1,The manipulative daughter of a Georgia plantat...,Victor Fleming,George Cukor,Sam Wood,Clark Gable,Vivien Leigh,304725,97.0,$198.68M
247,248,It Happened One Night,-1934,Passed,105 min,"Comedy, Romance",8.1,A renegade reporter trailing a young runaway h...,Frank Capra,Clark Gable,Claudette Colbert,Walter Connolly,Roscoe Karns,100198,87.0,$4.36M
248,249,The Passion of Joan of Arc,-1928,Passed,114 min,"Biography, Drama, History",8.1,"In 1431, Jeanne d'Arc is placed on trial on ch...",Carl Theodor Dreyer,Maria Falconetti,Eugene Silvain,Andr Berley,Maurice Schutz,52264,NaN,$0.02M
249,250,The General,-1926,Passed,67 min,"Action, Adventure, Comedy",8.1,After being rejected by the Confederate milita...,Clyde Bruckman,Buster Keaton,Buster Keaton,Marion Mack,Glen Cavender,88022,NaN,$1.03M

In [177]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ranking of movie    250 non-null    int64
 1   movie name          250 non-null    object
 2   Year                250 non-null    object
 3   certificate         250 non-null    object
 4   runtime             250 non-null    object
 5   genre               250 non-null    object
 6   RATING              250 non-null    float64
 7   DETAIL ABOUT MOVIE  250 non-null    object
 8   DIRECTOR            250 non-null    object
 9   ACTOR 1             250 non-null    object
 10  ACTOR 2             250 non-null    object
 11  ACTOR 3             250 non-null    object
 12  ACTOR 4             250 non-null    object
 13  votes               250 non-null    int64
 14  metascore           218 non-null    float64
 15  GROSS COLLECTION    214 non-null    object
dtypes: float64(2), int64(2), object(12)
memory usage: 31.4+ KB

In [178]:
movies_df.columns

Index(['ranking of movie', 'movie name ', 'Year', 'certificate', 'runtime',
       'genre', 'RATING', 'DETAIL ABOUT MOVIE', 'DIRECTOR ', 'ACTOR 1',
       'ACTOR 2', 'ACTOR 3', 'ACTOR 4', 'votes', 'metascore',
       'GROSS COLLECTION'],
      dtype='object')

In [179]:
# ['ranking of movie', 'certificate', 'DETAIL ABOUT MOVIE', 'ACTOR 3', 'ACTOR 4']
movies_df.drop(['ranking of movie', 'certificate', 'DETAIL ABOUT MOVIE', 'ACTOR 3', 'ACTOR 4'] ,axis =1, inplace= True)

In [180]:
movies_df

,movie name,Year,runtime,genre,RATING,DIRECTOR,ACTOR 1,ACTOR 2,votes,metascore,GROSS COLLECTION
0,Jai Bhim,-2021,164 min,"Crime, Drama",9.4,T.J. Gnanavel,Suriya,Lijo Mol Jose,163431,NaN,NaN
1,The Shawshank Redemption,-1994,142 min,Drama,9.3,Frank Darabont,Tim Robbins,Morgan Freeman,2515762,80.0,$28.34M
2,The Godfather,-1972,175 min,"Crime, Drama",9.2,Francis Ford Coppola,Marlon Brando,Al Pacino,1732749,100.0,$134.97M
3,The Dark Knight,-2008,152 min,"Action, Crime, Drama",9.0,Christopher Nolan,Christian Bale,Heath Ledger,2466041,84.0,$534.86M
4,The Godfather: Part II,-1974,202 min,"Crime, Drama",9.0,Francis Ford Coppola,Al Pacino,Robert De Niro,1202401,90.0,$57.30M
...,...,...,...,...,...,...,...,...,...,...,...
245,Mr. Smith Goes to Washington,-1939,129 min,"Comedy, Drama",8.1,Frank Capra,James Stewart,Jean Arthur,112642,73.0,$9.60M
246,Gone with the Wind,-1939,238 min,"Drama, History, Romance",8.1,Victor Fleming,George Cukor,Sam Wood,304725,97.0,$198.68M
247,It Happened One Night,-1934,105 min,"Comedy, Romance",8.1,Frank Capra,Clark Gable,Claudette Colbert,100198,87.0,$4.36M
248,The Passion of Joan of Arc,-1928,114 min,"Biography, Drama, History",8.1,Carl Theodor Dreyer,Maria Falconetti,Eugene Silvain,52264,NaN,$0.02M
249,The General,-1926,67 min,"Action, Adventure, Comedy",8.1,Clyde Bruckman,Buster Keaton,Buster Keaton,88022,NaN,$1.03M

In [181]:
movies_df.columns

Index(['movie name ', 'Year', 'runtime', 'genre', 'RATING', 'DIRECTOR ',
       'ACTOR 1', 'ACTOR 2', 'votes', 'metascore', 'GROSS COLLECTION'],
      dtype='object')

In [184]:
movies_df.columns = movies_df.columns.str.lower().str.strip()

In [186]:
movies_df.columns = movies_df.columns.str.replace(' ' ,'_')

In [187]:
movies_df.columns

Index(['movie_name', 'year', 'runtime', 'genre', 'rating', 'director',
       'actor_1', 'actor_2', 'votes', 'metascore', 'gross_collection'],
      dtype='object')

In [197]:
movies_df.rename({'year' : 'year1' , 'genre' :'genre1'}, inplace = True , axis=1)

In [198]:
movies_df

,movie_name,year1,runtime,genre1,rating,director,actor_1,actor_2,votes,metascore,gross_collection
0,Jai Bhim,-2021,164 min,"Crime, Drama",9.4,T.J. Gnanavel,Suriya,Lijo Mol Jose,163431,NaN,NaN
1,The Shawshank Redemption,-1994,142 min,Drama,9.3,Frank Darabont,Tim Robbins,Morgan Freeman,2515762,80.0,$28.34M
2,The Godfather,-1972,175 min,"Crime, Drama",9.2,Francis Ford Coppola,Marlon Brando,Al Pacino,1732749,100.0,$134.97M
3,The Dark Knight,-2008,152 min,"Action, Crime, Drama",9.0,Christopher Nolan,Christian Bale,Heath Ledger,2466041,84.0,$534.86M
4,The Godfather: Part II,-1974,202 min,"Crime, Drama",9.0,Francis Ford Coppola,Al Pacino,Robert De Niro,1202401,90.0,$57.30M
...,...,...,...,...,...,...,...,...,...,...,...
245,Mr. Smith Goes to Washington,-1939,129 min,"Comedy, Drama",8.1,Frank Capra,James Stewart,Jean Arthur,112642,73.0,$9.60M
246,Gone with the Wind,-1939,238 min,"Drama, History, Romance",8.1,Victor Fleming,George Cukor,Sam Wood,304725,97.0,$198.68M
247,It Happened One Night,-1934,105 min,"Comedy, Romance",8.1,Frank Capra,Clark Gable,Claudette Colbert,100198,87.0,$4.36M
248,The Passion of Joan of Arc,-1928,114 min,"Biography, Drama, History",8.1,Carl Theodor Dreyer,Maria Falconetti,Eugene Silvain,52264,NaN,$0.02M
249,The General,-1926,67 min,"Action, Adventure, Comedy",8.1,Clyde Bruckman,Buster Keaton,Buster Keaton,88022,NaN,$1.03M

In [199]:
movies_df.rename({'year1' : 'year' , 'genre1' :'genre'}, inplace = True , axis=1)

In [200]:
movies_df

,movie_name,year,runtime,genre,rating,director,actor_1,actor_2,votes,metascore,gross_collection
0,Jai Bhim,-2021,164 min,"Crime, Drama",9.4,T.J. Gnanavel,Suriya,Lijo Mol Jose,163431,NaN,NaN
1,The Shawshank Redemption,-1994,142 min,Drama,9.3,Frank Darabont,Tim Robbins,Morgan Freeman,2515762,80.0,$28.34M
2,The Godfather,-1972,175 min,"Crime, Drama",9.2,Francis Ford Coppola,Marlon Brando,Al Pacino,1732749,100.0,$134.97M
3,The Dark Knight,-2008,152 min,"Action, Crime, Drama",9.0,Christopher Nolan,Christian Bale,Heath Ledger,2466041,84.0,$534.86M
4,The Godfather: Part II,-1974,202 min,"Crime, Drama",9.0,Francis Ford Coppola,Al Pacino,Robert De Niro,1202401,90.0,$57.30M
...,...,...,...,...,...,...,...,...,...,...,...
245,Mr. Smith Goes to Washington,-1939,129 min,"Comedy, Drama",8.1,Frank Capra,James Stewart,Jean Arthur,112642,73.0,$9.60M
246,Gone with the Wind,-1939,238 min,"Drama, History, Romance",8.1,Victor Fleming,George Cukor,Sam Wood,304725,97.0,$198.68M
247,It Happened One Night,-1934,105 min,"Comedy, Romance",8.1,Frank Capra,Clark Gable,Claudette Colbert,100198,87.0,$4.36M
248,The Passion of Joan of Arc,-1928,114 min,"Biography, Drama, History",8.1,Carl Theodor Dreyer,Maria Falconetti,Eugene Silvain,52264,NaN,$0.02M
249,The General,-1926,67 min,"Action, Adventure, Comedy",8.1,Clyde Bruckman,Buster Keaton,Buster Keaton,88022,NaN,$1.03M

In [201]:
movies_df.describe(
)

           rating         votes   metascore
count  250.000000  2.500000e+02  218.000000
mean     8.308400  5.785299e+05   82.449541
std      0.234669  4.951304e+05   10.822392
min      8.100000  2.653800e+04   55.000000
25%      8.100000  1.688628e+05   75.000000
50%      8.200000  4.313355e+05   84.000000
75%      8.400000  8.854255e+05   90.000000
max      9.400000  2.515762e+06  100.000000

## What is the minimum and maximum ratings ?

In [203]:
movies_df['rating'].min()

8.1

In [204]:
movies_df['rating'].max()

9.4

## What are the movies with rating > 9 ?

In [206]:
movies_df[movies_df['rating'] > 9]

,movie_name,year,runtime,genre,rating,director,actor_1,actor_2,votes,metascore,gross_collection
0,Jai Bhim,-2021,164 min,"Crime, Drama",9.4,T.J. Gnanavel,Suriya,Lijo Mol Jose,163431,NaN,NaN
1,The Shawshank Redemption,-1994,142 min,Drama,9.3,Frank Darabont,Tim Robbins,Morgan Freeman,2515762,80.0,$28.34M
2,The Godfather,-1972,175 min,"Crime, Drama",9.2,Francis Ford Coppola,Marlon Brando,Al Pacino,1732749,100.0,$134.97M

In [207]:
movies_df[movies_df['rating'] > 9]['movie_name']

0                    Jai Bhim
1    The Shawshank Redemption
2               The Godfather
Name: movie_name, dtype: object

In [208]:
movies_df[movies_df['rating'] > 9][['movie_name' , 'rating']]

                 movie_name  rating
0                  Jai Bhim     9.4
1  The Shawshank Redemption     9.3
2             The Godfather     9.2

In [209]:
movies_df[movies_df['rating'] > 9][['movie_name' , 'rating']].sort_values(by='rating')

                 movie_name  rating
2             The Godfather     9.2
1  The Shawshank Redemption     9.3
0                  Jai Bhim     9.4

## Top 10 movies per metascore and user rating

In [211]:
movies_df.head()

,movie_name,year,runtime,genre,rating,director,actor_1,actor_2,votes,metascore,gross_collection
0,Jai Bhim,-2021,164 min,"Crime, Drama",9.4,T.J. Gnanavel,Suriya,Lijo Mol Jose,163431,NaN,NaN
1,The Shawshank Redemption,-1994,142 min,Drama,9.3,Frank Darabont,Tim Robbins,Morgan Freeman,2515762,80.0,$28.34M
2,The Godfather,-1972,175 min,"Crime, Drama",9.2,Francis Ford Coppola,Marlon Brando,Al Pacino,1732749,100.0,$134.97M
3,The Dark Knight,-2008,152 min,"Action, Crime, Drama",9.0,Christopher Nolan,Christian Bale,Heath Ledger,2466041,84.0,$534.86M
4,The Godfather: Part II,-1974,202 min,"Crime, Drama",9.0,Francis Ford Coppola,Al Pacino,Robert De Niro,1202401,90.0,$57.30M

In [215]:
top_movies_per_metascore = movies_df[['movie_name','metascore']].sort_values('metascore', ascending=False)

In [217]:
top_movies_per_metascore.head(10)

              movie_name  metascore
112              Vertigo      100.0
109   Lawrence of Arabia      100.0
117         Citizen Kane      100.0
50            Casablanca      100.0
49           Rear Window      100.0
2          The Godfather      100.0
224  Fanny and Alexander      100.0
113  Singin' in the Rain       99.0
52           City Lights       99.0
31         Seven Samurai       98.0

In [218]:
top_movies_per_rating = movies_df[['movie_name','rating']].sort_values('rating', ascending=False)

In [220]:
top_movies_per_rating.head(10)

                                           movie_name  rating
0                                            Jai Bhim     9.4
1                            The Shawshank Redemption     9.3
2                                       The Godfather     9.2
3                                     The Dark Knight     9.0
4                              The Godfather: Part II     9.0
5                                        12 Angry Men     9.0
6       The Lord of the Rings: The Return of the King     8.9
7                                        Pulp Fiction     8.9
8                                    Schindler's List     8.9
12  The Lord of the Rings: The Fellowship of the Ring     8.8

## Top 10 genres

In [223]:
movies_df['genre'].value_counts()

Drama                        22
Crime, Drama                 14
Biography, Drama, History     9
Drama, War                    8
Crime, Drama, Mystery         8
                             ..
Animation, Drama              1
Drama, Mystery, Romance       1
Biography, Comedy, Crime      1
Drama, Fantasy, War           1
Action, Adventure, Comedy     1
Name: genre, Length: 109, dtype: int64

In [225]:
movies_df['genre'].nunique()

109

In [233]:
movies_df.groupby('genre')['movie_name'].count().sort_values(ascending=False).head(10)

genre
Drama                           22
Crime, Drama                    14
Biography, Drama, History        9
Animation, Adventure, Comedy     8
Crime, Drama, Mystery            8
Drama, War                       8
Drama, Romance                   7
Action, Crime, Drama             7
Action, Adventure, Drama         6
Action, Adventure, Sci-Fi        5
Name: movie_name, dtype: int64

In [234]:
movies_df.columns

Index(['movie_name', 'year', 'runtime', 'genre', 'rating', 'director',
       'actor_1', 'actor_2', 'votes', 'metascore', 'gross_collection'],
      dtype='object')

In [237]:
movies_df.groupby('actor_1')['rating'].mean().sort_values(ascending=False).head(10)

actor_1
Suriya             9.40
Tim Robbins        9.30
Liam Neeson        8.90
John Travolta      8.90
Tom Holland        8.80
Elijah Wood        8.80
Henry Fonda        8.75
Lilly Wachowski    8.70
Marlon Brando      8.65
Daveigh Chase      8.60
Name: rating, dtype: float64

In [238]:
movies_df.groupby('actor_2')['rating'].mean().sort_values(ascending=False).head(10)

actor_2
Lijo Mol Jose           9.4
Morgan Freeman          9.3
Al Pacino               9.2
Heath Ledger            9.0
Lee J. Cobb             9.0
Viggo Mortensen         8.9
Ralph Fiennes           8.9
Uma Thurman             8.9
Zendaya                 8.8
Joseph Gordon-Levitt    8.8
Name: rating, dtype: float64